### pandas Groupby 練習

In [3]:
import pandas as pd
import numpy as np

In [4]:
company = ["A","B","C"]

data = pd.DataFrame(
    {
      "company":[company[x] for x in np.random.randint(0,len(company),10)],
      "salary":np.random.randint(5,50,10),
      "age":np.random.randint(15,50,10),
    }
)

In [5]:
data

  company  salary  age
0       C       5   35
1       A      48   24
2       C      44   22
3       C      19   43
4       A      31   21
5       B       7   18
6       A      19   24
7       C      28   36
8       A      27   28
9       C      16   28

In [6]:
group = data.groupby("company")
group

In [7]:
list(group)

[('A',
    company  salary  age
  1       A      48   24
  4       A      31   21
  6       A      19   24
  8       A      27   28),
 ('B',
    company  salary  age
  5       B       7   18),
 ('C',
    company  salary  age
  0       C       5   35
  2       C      44   22
  3       C      19   43
  7       C      28   36
  9       C      16   28)]

In [8]:
data.groupby("company").agg('mean')

         salary    age
company
A         31.25  24.25
B          7.00  18.00
C         22.40  32.80

In [9]:
data.groupby('company').agg({'salary':'median','age':'mean'})

         salary    age
company
A            29  24.25
B             7  18.00
C            19  32.80

In [12]:
avg_salary_dict = data.groupby("company")['salary'].mean().to_dict()
type(avg_salary_dict)

dict

In [15]:
data['avg_salary']= data['company'].map(avg_salary_dict)
data

  company  salary  age  avg_salary
0       C       5   35       22.40
1       A      48   24       31.25
2       C      44   22       22.40
3       C      19   43       22.40
4       A      31   21       31.25
5       B       7   18        7.00
6       A      19   24       31.25
7       C      28   36       22.40
8       A      27   28       31.25
9       C      16   28       22.40

In [18]:
data['arg_salary'] = data.groupby('company')['salary'].transform('mean')
data

  company  salary  age  avg_salary  arg_salary
0       C       5   35       22.40       22.40
1       A      48   24       31.25       31.25
2       C      44   22       22.40       22.40
3       C      19   43       22.40       22.40
4       A      31   21       31.25       31.25
5       B       7   18        7.00        7.00
6       A      19   24       31.25       31.25
7       C      28   36       22.40       22.40
8       A      27   28       31.25       31.25
9       C      16   28       22.40       22.40

In [19]:
def get_oldest_staff(x):
    df = x.sort_values(by = 'age',ascending = True)
    return df.iloc[-1,:]

oldest_staff = data.groupby('company',as_index=False).apply(get_oldest_staff)
oldest_staff

  company  salary  age  avg_salary  arg_salary
0       A      27   28       31.25       31.25
1       B       7   18        7.00        7.00
2       C      19   43       22.40       22.40